script/k6-scripts/results/20260619-214734/jwt_false_casbin_false_rl_false_pool_false_iam_groups_list.log
 Container RPA-minio Running 
 Container RPA-pgdb Running 
 Container RPA-redis Running 
 Container RPA-cadvisor Running 
 Container rmqnamesrv Running 
 Container rmqbroker Running 
 Container RPA-prometheus Running 
 Container RPA-app Running 
 Container script-k6-run-aeafb03994e4 Creating 
 Container script-k6-run-aeafb03994e4 Created 

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/apis/iam_groups_list.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * single_api: 300.00 iterations/s for 1m0s (maxVUs: 150-200, exec: singleApi, gracefulStop: 30s)


running (0m01.0s), 001/150 VUs, 294 complete and 0 interrupted iterations
single_api   [   2% ] 001/150 VUs  0m01.0s/1m0s  300.00 iters/s

running (0m02.0s), 001/150 VUs, 594 complete and 0 interrupted iterations
single_api   [   3% ] 001/150 VUs  0m02.0s/1m0s  300.00 iters/s

running (0m03.0s), 001/150 VUs, 894 complete and 0 interrupted iterations
single_api   [   5% ] 001/150 VUs  0m03.0s/1m0s  300.00 iters/s

running (0m04.0s), 000/150 VUs, 1194 complete and 0 interrupted iterations
single_api   [   7% ] 000/150 VUs  0m04.0s/1m0s  300.00 iters/s

running (0m05.0s), 000/150 VUs, 1494 complete and 0 interrupted iterations
single_api   [   8% ] 000/150 VUs  0m05.0s/1m0s  300.00 iters/s

running (0m06.0s), 000/150 VUs, 1794 complete and 0 interrupted iterations
single_api   [  10% ] 000/150 VUs  0m06.0s/1m0s  300.00 iters/s

running (0m07.0s), 001/150 VUs, 2094 complete and 0 interrupted iterations
single_api   [  12% ] 001/150 VUs  0m07.0s/1m0s  300.00 iters/s

running (0m08.0s), 000/150 VUs, 2394 complete and 0 interrupted iterations
single_api   [  13% ] 000/150 VUs  0m08.0s/1m0s  300.00 iters/s

running (0m09.0s), 000/150 VUs, 2694 complete and 0 interrupted iterations
single_api   [  15% ] 000/150 VUs  0m09.0s/1m0s  300.00 iters/s

running (0m10.0s), 000/150 VUs, 2994 complete and 0 interrupted iterations
single_api   [  17% ] 000/150 VUs  0m10.0s/1m0s  300.00 iters/s

running (0m11.0s), 000/150 VUs, 3294 complete and 0 interrupted iterations
single_api   [  18% ] 000/150 VUs  0m11.0s/1m0s  300.00 iters/s

running (0m12.0s), 001/150 VUs, 3594 complete and 0 interrupted iterations
single_api   [  20% ] 001/150 VUs  0m12.0s/1m0s  300.00 iters/s

running (0m13.0s), 000/150 VUs, 3894 complete and 0 interrupted iterations
single_api   [  22% ] 000/150 VUs  0m13.0s/1m0s  300.00 iters/s

running (0m14.0s), 000/150 VUs, 4194 complete and 0 interrupted iterations
single_api   [  23% ] 000/150 VUs  0m14.0s/1m0s  300.00 iters/s

running (0m15.0s), 000/150 VUs, 4494 complete and 0 interrupted iterations
single_api   [  25% ] 000/150 VUs  0m15.0s/1m0s  300.00 iters/s

running (0m16.0s), 002/150 VUs, 4793 complete and 0 interrupted iterations
single_api   [  27% ] 002/150 VUs  0m16.0s/1m0s  300.00 iters/s

running (0m17.0s), 000/150 VUs, 5094 complete and 0 interrupted iterations
single_api   [  28% ] 000/150 VUs  0m17.0s/1m0s  300.00 iters/s

running (0m18.0s), 000/150 VUs, 5394 complete and 0 interrupted iterations
single_api   [  30% ] 000/150 VUs  0m18.0s/1m0s  300.00 iters/s

running (0m19.0s), 000/150 VUs, 5694 complete and 0 interrupted iterations
single_api   [  32% ] 000/150 VUs  0m19.0s/1m0s  300.00 iters/s

running (0m20.0s), 000/150 VUs, 5994 complete and 0 interrupted iterations
single_api   [  33% ] 000/150 VUs  0m20.0s/1m0s  300.00 iters/s

running (0m21.0s), 000/150 VUs, 6294 complete and 0 interrupted iterations
single_api   [  35% ] 000/150 VUs  0m21.0s/1m0s  300.00 iters/s

running (0m22.0s), 000/150 VUs, 6594 complete and 0 interrupted iterations
single_api   [  37% ] 000/150 VUs  0m22.0s/1m0s  300.00 iters/s

running (0m23.0s), 000/150 VUs, 6894 complete and 0 interrupted iterations
single_api   [  38% ] 000/150 VUs  0m23.0s/1m0s  300.00 iters/s

running (0m24.0s), 000/150 VUs, 7194 complete and 0 interrupted iterations
single_api   [  40% ] 000/150 VUs  0m24.0s/1m0s  300.00 iters/s

running (0m25.0s), 001/150 VUs, 7494 complete and 0 interrupted iterations
single_api   [  42% ] 001/150 VUs  0m25.0s/1m0s  300.00 iters/s

running (0m26.0s), 001/150 VUs, 7794 complete and 0 interrupted iterations
single_api   [  43% ] 001/150 VUs  0m26.0s/1m0s  300.00 iters/s

running (0m27.0s), 000/150 VUs, 8094 complete and 0 interrupted iterations
single_api   [  45% ] 000/150 VUs  0m27.0s/1m0s  300.00 iters/s

running (0m28.0s), 001/150 VUs, 8394 complete and 0 interrupted iterations
single_api   [  47% ] 001/150 VUs  0m28.0s/1m0s  300.00 iters/s

running (0m29.0s), 001/150 VUs, 8694 complete and 0 interrupted iterations
single_api   [  48% ] 001/150 VUs  0m29.0s/1m0s  300.00 iters/s

running (0m30.0s), 000/150 VUs, 8994 complete and 0 interrupted iterations
single_api   [  50% ] 000/150 VUs  0m30.0s/1m0s  300.00 iters/s

running (0m31.0s), 001/150 VUs, 9294 complete and 0 interrupted iterations
single_api   [  52% ] 001/150 VUs  0m31.0s/1m0s  300.00 iters/s

running (0m32.0s), 000/150 VUs, 9594 complete and 0 interrupted iterations
single_api   [  53% ] 000/150 VUs  0m32.0s/1m0s  300.00 iters/s

running (0m33.0s), 001/150 VUs, 9894 complete and 0 interrupted iterations
single_api   [  55% ] 001/150 VUs  0m33.0s/1m0s  300.00 iters/s

running (0m34.0s), 001/150 VUs, 10194 complete and 0 interrupted iterations
single_api   [  57% ] 001/150 VUs  0m34.0s/1m0s  300.00 iters/s

running (0m35.0s), 001/150 VUs, 10494 complete and 0 interrupted iterations
single_api   [  58% ] 001/150 VUs  0m35.0s/1m0s  300.00 iters/s

running (0m36.0s), 000/150 VUs, 10794 complete and 0 interrupted iterations
single_api   [  60% ] 000/150 VUs  0m36.0s/1m0s  300.00 iters/s

running (0m37.0s), 001/150 VUs, 11094 complete and 0 interrupted iterations
single_api   [  62% ] 001/150 VUs  0m37.0s/1m0s  300.00 iters/s

running (0m38.0s), 001/150 VUs, 11394 complete and 0 interrupted iterations
single_api   [  63% ] 001/150 VUs  0m38.0s/1m0s  300.00 iters/s

running (0m39.0s), 001/150 VUs, 11694 complete and 0 interrupted iterations
single_api   [  65% ] 001/150 VUs  0m39.0s/1m0s  300.00 iters/s

running (0m40.0s), 000/150 VUs, 11994 complete and 0 interrupted iterations
single_api   [  67% ] 000/150 VUs  0m40.0s/1m0s  300.00 iters/s

running (0m41.0s), 001/150 VUs, 12294 complete and 0 interrupted iterations
single_api   [  68% ] 001/150 VUs  0m41.0s/1m0s  300.00 iters/s

running (0m42.0s), 001/150 VUs, 12594 complete and 0 interrupted iterations
single_api   [  70% ] 001/150 VUs  0m42.0s/1m0s  300.00 iters/s

running (0m43.0s), 000/150 VUs, 12894 complete and 0 interrupted iterations
single_api   [  72% ] 000/150 VUs  0m43.0s/1m0s  300.00 iters/s

running (0m44.0s), 000/150 VUs, 13194 complete and 0 interrupted iterations
single_api   [  73% ] 000/150 VUs  0m44.0s/1m0s  300.00 iters/s

running (0m45.0s), 001/150 VUs, 13494 complete and 0 interrupted iterations
single_api   [  75% ] 001/150 VUs  0m45.0s/1m0s  300.00 iters/s

running (0m46.0s), 001/150 VUs, 13794 complete and 0 interrupted iterations
single_api   [  77% ] 001/150 VUs  0m46.0s/1m0s  300.00 iters/s

running (0m47.0s), 000/150 VUs, 14094 complete and 0 interrupted iterations
single_api   [  78% ] 000/150 VUs  0m47.0s/1m0s  300.00 iters/s

running (0m48.0s), 000/150 VUs, 14394 complete and 0 interrupted iterations
single_api   [  80% ] 000/150 VUs  0m48.0s/1m0s  300.00 iters/s

running (0m49.0s), 000/150 VUs, 14694 complete and 0 interrupted iterations
single_api   [  82% ] 000/150 VUs  0m49.0s/1m0s  300.00 iters/s

running (0m50.0s), 001/150 VUs, 14994 complete and 0 interrupted iterations
single_api   [  83% ] 001/150 VUs  0m50.0s/1m0s  300.00 iters/s

running (0m51.0s), 001/150 VUs, 15294 complete and 0 interrupted iterations
single_api   [  85% ] 001/150 VUs  0m51.0s/1m0s  300.00 iters/s

running (0m52.0s), 001/150 VUs, 15594 complete and 0 interrupted iterations
single_api   [  87% ] 001/150 VUs  0m52.0s/1m0s  300.00 iters/s

running (0m53.0s), 001/150 VUs, 15894 complete and 0 interrupted iterations
single_api   [  88% ] 001/150 VUs  0m53.0s/1m0s  300.00 iters/s

running (0m54.0s), 000/150 VUs, 16194 complete and 0 interrupted iterations
single_api   [  90% ] 000/150 VUs  0m54.0s/1m0s  300.00 iters/s

running (0m55.0s), 001/150 VUs, 16494 complete and 0 interrupted iterations
single_api   [  92% ] 001/150 VUs  0m55.0s/1m0s  300.00 iters/s

running (0m56.0s), 000/150 VUs, 16794 complete and 0 interrupted iterations
single_api   [  93% ] 000/150 VUs  0m56.0s/1m0s  300.00 iters/s

running (0m57.0s), 000/150 VUs, 17094 complete and 0 interrupted iterations
single_api   [  95% ] 000/150 VUs  0m57.0s/1m0s  300.00 iters/s

running (0m58.0s), 000/150 VUs, 17394 complete and 0 interrupted iterations
single_api   [  97% ] 000/150 VUs  0m58.0s/1m0s  300.00 iters/s

running (0m59.0s), 000/150 VUs, 17694 complete and 0 interrupted iterations
single_api   [  98% ] 000/150 VUs  0m59.0s/1m0s  300.00 iters/s

running (1m00.0s), 000/150 VUs, 17994 complete and 0 interrupted iterations
single_api   [ 100% ] 000/150 VUs  1m00.0s/1m0s  300.00 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=1.13ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 18000   299.99105/s
    checks_succeeded...: 100.00% 18000 out of 18000
    checks_failed......: 0.00%   0 out of 18000

    ✓ iam_groups_list status

    HTTP
    http_req_duration..............: avg=850.97µs min=372.6µs med=901.61µs max=4.72ms  p(90)=1.07ms p(95)=1.13ms
      { expected_response:true }...: avg=850.97µs min=372.6µs med=901.61µs max=4.72ms  p(90)=1.07ms p(95)=1.13ms
    http_req_failed................: 0.00%  0 out of 18000
    http_reqs......................: 18000  299.99105/s

    EXECUTION
    iteration_duration.............: avg=1.02ms   min=458µs   med=1.07ms   max=22.95ms p(90)=1.28ms p(95)=1.36ms
    iterations.....................: 18000  299.99105/s
    vus............................: 0      min=0          max=2  
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 226 MB 3.8 MB/s
    data_sent......................: 2.5 MB 42 kB/s



running (1m00.0s), 000/150 VUs, 18000 complete and 0 interrupted iterations
single_api ✓ [ 100% ] 000/150 VUs  1m0s  300.00 iters/s